BAS BMEKZU Project/src/InformationRegisters/ПараметрыОценкиЗапасовНаДатуБаланса/ПараметрыОценкиЗапасовНаДатуБаланса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыОценкиЗапасовНаДатуБаланса</name>
  <resources>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>Субконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>СчетДоходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоДоходов1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоДоходов2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоДоходов3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/InformationRegisters/ПараметрыОценкиЗапасовНаДатуБаланса/Forms/ФормаЗаписи/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗаголовкиИДоступностьСубконто("СчетЗатрат");
	УстановитьЗаголовкиИДоступностьСубконто("СчетДоходов");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетЗатратПриИзменении(Элемент)
	УстановитьЗаголовкиИДоступностьСубконто("СчетЗатрат");
КонецПроцедуры

&НаКлиенте
Процедура СчетДоходовПриИзменении(Элемент)
	УстановитьЗаголовкиИДоступностьСубконто("СчетДоходов");
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьЗаголовкиИДоступностьСубконто(ИмяСчета)

	ПоляФормы		= Новый Структура("Субконто1, Субконто2, Субконто3",
		"Субконто1"+ИмяСчета, "Субконто2"+ИмяСчета, "Субконто3"+ИмяСчета);
	
	ЗаголовкиПолей	= Новый Структура("Субконто1, Субконто2, Субконто3",
		"ЗаголовокСубконто1"+ИмяСчета, "ЗаголовокСубконто2"+ИмяСчета, "ЗаголовокСубконто3"+ИмяСчета); 
		
	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Запись[ИмяСчета], ЭтаФорма, ПоляФормы, ЗаголовкиПолей);

КонецПроцедуры
